Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# gpg_user_id_replacement_value_title
source: New GPG User ID
ar: معرّف مستخدم GPG جديد
fr: Nouvel identifiant utilisateur GPG
pt_br: Nova ID de usuário GPG
pt_pt: Novo ID de utilizador GPG

# gpg_user_id_revocation_already_done_message
source: This User ID was already revoked. No new signature was created.
ar: تم إبطال معرّف المستخدم هذا بالفعل. لم يُنشأ توقيع جديد.
fr: Cet identifiant utilisateur a déjà été révoqué. Aucune nouvelle signature n'a été créée.
pt_br: Este ID de usuário já foi revogado. Nenhuma nova assinatura foi criada.
pt_pt: Este ID de utilizador já foi revogado. Nenhuma nova assinatura foi criada.

# gpg_user_id_revocation_confirm
source: Revoke
ar: إبطال
fr: Révoquer
pt_br: Revogar
pt_pt: Revogar

# gpg_user_id_revocation_dialog_message
source: Select the User ID to revoke. Revocation adds a signed statement to the certificate and does not erase the identity or its history.
ar: حدّد معرّف المستخدم المراد إبطاله. يضيف الإبطال بيانًا موقّعًا إلى الشهادة ولا يمحو الهوية أو سجلها.
fr: Sélectionnez l'identifiant utilisateur à révoquer. La révocation ajoute une déclaration signée au certificat et n'efface ni l'identité ni son historique.
pt_br: Selecione o ID do usuário a ser revogado. A revogação adiciona uma declaração assinada ao certificado e não apaga a identidade ou o seu histórico.
pt_pt: Selecione o ID do utilizador que pretende revogar. A revogação acrescenta uma declaração assinada ao certificado e não apaga a identidade nem o seu histórico.

# gpg_user_id_revocation_dialog_title
source: Revoke GPG User ID
ar: إبطال معرّف مستخدم GPG
fr: Révoquer l'identifiant utilisateur GPG
pt_br: Revogar ID de usuário GPG
pt_pt: Revogar ID de utilizador GPG

# gpg_user_id_revocation_failed_message
source: The User ID could not be revoked. The original key was left unchanged.
ar: تعذّر إبطال معرّف المستخدم. تُرك المفتاح الأصلي دون تغيير.
fr: L'identifiant utilisateur n'a pas pu être révoqué. La clé d'origine est restée inchangée.
pt_br: O ID do usuário não pôde ser revogado. A chave original permaneceu inalterada.
pt_pt: O ID do utilizador não pôde ser revogado. A chave original permaneceu inalterada.

# gpg_user_id_revocation_failed_title
source: Failed to revoke GPG User ID
ar: فشل إبطال معرّف مستخدم GPG
fr: Impossible de révoquer l'identifiant utilisateur GPG
pt_br: Falha ao revogar o ID de usuário do GPG
pt_pt: Falha ao revogar o ID de utilizador GPG

# gpg_user_id_revocation_last_identity_message
source: A GPG key must keep at least one usable User ID. Add a replacement before revoking this one.
ar: يجب أن يحتفظ مفتاح GPG بمعرّف مستخدم واحد قابل للاستخدام على الأقل. أضف بديلاً قبل إبطال هذا المعرّف.
fr: Une clé GPG doit conserver au moins un identifiant utilisateur utilisable. Remplacez-le avant de le révoquer.
pt_br: Uma chave GPG deve manter pelo menos um ID de usuário utilizável. Adicione um substituto antes de revogar este.
pt_pt: Uma chave GPG deve manter pelo menos um ID de utilizador utilizável. Adicione uma chave de substituição antes de revogar esta.

# gpg_user_id_revocation_no_identity_message
source: This key has no active User ID that can be revoked.
ar: لا يحتوي هذا المفتاح على معرّف مستخدم نشط يمكن إبطاله.
fr: Cette clé n'a pas d'identifiant utilisateur actif révocable.
pt_br: Esta chave não possui ID de usuário ativo que possa ser revogada.
pt_pt: Esta chave não tem um ID de utilizador ativo que possa ser revogado.

# gpg_user_id_revocation_private_key_required
source: Import the private key to revoke one of its User IDs.
ar: استورد المفتاح الخاص لإبطال أحد معرّفات المستخدم الخاصة به.
fr: Importez la clé privée pour révoquer l'un de ses identifiants utilisateur.
pt_br: Importe a chave privada para revogar um de seus IDs de usuário.
pt_pt: Importe a chave privada para revogar um dos seus IDs de utilizador.

# gpg_user_id_revocation_success_message
source: Save this item, then redistribute or upload its public key to publish the revocation.
ar: احفظ هذا العنصر، ثم أعد توزيع مفتاحه العام أو ارفعه لنشر الإبطال.
fr: Enregistrez cet élément, puis redistribuez ou téléversez sa clé publique pour publier la révocation.
pt_br: Salve este item e redistribua ou carregue sua chave pública para publicar a revogação.
pt_pt: Guarde este item e, em seguida, redistribua-o ou carregue a sua chave pública para publicar a revogação.

# gpg_user_id_revocation_success_title
source: GPG User ID revoked
ar: تم إبطال معرّف مستخدم GPG
fr: Identifiant utilisateur GPG révoqué
pt_br: ID de usuário GPG revogado
pt_pt: ID de utilizador GPG revogada

# gpg_user_id_revocation_target_missing
source: The selected User ID changed or is no longer eligible. Reopen the key and try again.
ar: تغيّر معرّف المستخدم المحدد أو لم يعد مؤهلاً. أعد فتح المفتاح وحاول مرة أخرى.
fr: L'identifiant utilisateur sélectionné a changé ou n'est plus éligible. Réouvrez la clé et réessayez.
pt_br: O ID do usuário selecionado foi alterado ou não é mais elegível. Reabra a chave e tente novamente.
pt_pt: O ID de utilizador selecionado foi alterado ou já não é elegível. Volte a abrir a chave e tente novamente.

# gpg_user_id_revocation_title
source: Revoke User ID
ar: إبطال معرّف المستخدم
fr: Révoquer l'identifiant utilisateur
pt_br: Revogar ID do Usuário
pt_pt: Revogar ID de utilizador

# gpg_user_id_revocation_unavailable
source: GPG User-ID revocation is not supported on this platform.
ar: إبطال معرّف مستخدم GPG غير مدعوم على هذه المنصة.
fr: La révocation de l'identifiant utilisateur GPG n'est pas prise en charge sur cette plateforme.
pt_br: A revogação do ID do usuário GPG não é suportada nesta plataforma.
pt_pt: A revogação de IDs de utilizador GPG não é suportada nesta plataforma.

source: Grant permission
ar: منح الإذن
de: Zugriff gewähren
es: Otorgar permiso
fr: Accorder la permission
hu: Engedély megadása
it: Concedi autorizzazione
ja: 権限を許可
ko: 권한 허용
pt_br: Conceder permissão
pt_pt: Conceder permissão
ru: Выдать разрешение
uk: Надати дозвіл
zh_hans: 授权

source: Hidden
ar: مختفي
de: Verborgen
es: Oculto
fr: Masqué
hu: Rejtve
it: Nascosto
ja: 非表示
ko: 숨김
pt_br: Oculto
pt_pt: Oculto
ru: Скрыто
uk: Приховано
zh_hans: 隐藏

# hide_secure_note
source: Hide a secure note
ar: إخفاء ملاحظة آمنة
de: Sichere Notiz ausblenden
es: Ocultar una nota segura
fr: Masquer une note sécurisée
hu: Biztonságos jegyzet elrejtése
it: Nascondi una nota sicura
ja: セキュアメモを非表示
ko: 보안 노트 숨기기
pt_br: Esconder uma nota segura
pt_pt: Esconder nota segura
ru: Скрыть защищенную заметку
uk: Приховати захищену нотатку
zh_hans: 隐藏安全笔记

# home_favorites_label
source: Favorites
ar: المفضلة
de: Favoriten
es: Favoritos
fr: Favoris
hu: Kedvencek
ko: 즐겨찾기
pt_br: Favoritos
pt_pt: Favoritos
uk: Обране
zh_hans: 收藏

# home_generator_label
source: Generator
ar: مولد
es: Generador
fr: Générateur
hu: Generátor
it: Generatore
ja: パス生成
ko: 생성기
pt_br: Gerador
pt_pt: Gerador
ru: Генератор
uk: Генератор
zh_hans: 生成器

# home_other_label
source: Other
ar: أخرى
de: Weitere
es: Otros
fr: Autre
hu: Egyéb
ko: 기타
pt_br: Outro
pt_pt: Outro
uk: Інше
zh_hans: 其它

# home_send_label
source: Send
ar: يرسل
es: Envío
fr: Envoyer
hu: Küldés
pt_pt: Partilhar
uk: Відправл.

# home_settings_label
source: Settings
ar: إعدادات
de: Einstellungen
es: Ajustes
fr: Paramètres
hu: Beállítások
it: Impostazioni
ja: 設定
ko: 설정
pt_br: Configurações
pt_pt: Definições
ru: Настройки
uk: Налашт.
zh_hans: 设置

# home_vault_label
source: Vault
ar: قبو
de: Tresor
es: Caja fuerte
fr: Coffre-fort
hu: Széf
it: Cassaforte
ja: 保管庫
ko: 보관함
pt_br: Cofre
pt_pt: Cofre
ru: Хранилище
uk: Сховище
zh_hans: 密码库

# home_watchtower_label
source: Watchtower
ar: برج المراقبة
de: Wachturm
es: Informes
hu: Őrtorony
ja: 監視
ko: 감시탑
pt_br: Guardião
pt_pt: Guardião
ru: Доз. башня
uk: Варт. вежа
zh_hans: 概况

# hours_plural
source: %lld hours
ar: %lld ساعات
de: %lld Stunden
es: %lld horas
fr: %lld heures
hu: %lld óra
it: %lld ore
ja: %lld 時間
ko: %lld시간
pt_br: %lld horas
pt_pt: %lld horas
ru: %lld часов
uk: %lld годин
zh_hans: %lld 小时

# identity_first_name
source: First name
ar: الاسم الأول
de: Vorname
es: Primer nombre
fr: Prénom
hu: Keresztnév
it: Nome
ja: 名
ko: 이름
pt_br: Primeiro nome
pt_pt: Nome próprio
ru: Имя
uk: Ім'я
zh_hans: 名

# identity_full_name
source: Full name
ar: الاسم الكامل
de: Vollständiger Name
es: Nombre completo
fr: Nom complet
hu: Teljes név
it: Nome e cognome
ja: 氏名
ko: 전체 이름
pt_br: Nome completo
pt_pt: Nome completo
ru: ФИО
uk: Повне ім'я
zh_hans: 全名

# identity_last_name
source: Last name
ar: اسم العائلة
de: Nachname
es: Apellido(s)
fr: Nom de famille
hu: Vezetéknév
it: Cognome
ja: 姓
ko: 성
pt_br: Sobrenome
pt_pt: Sobrenome
ru: Фамилия
uk: Прізвище
zh_hans: 姓

# identity_middle_name
source: Middle name
ar: الاسم الأوسط
de: Zweitname
es: Segundo nombre
fr: Deuxième prénom
hu: Középső név
it: Secondo nome
ja: ミドルネーム
ko: 가운데 이름
pt_br: Nome do Meio
pt_pt: Apelidos
ru: Отчество
uk: По батькові
zh_hans: 中间名

# identity_title
source: Title
ar: عنوان
de: Titel
es: Título
fr: Titre
hu: Titulus
it: Titolo
ja: タイトル
ko: 제목
pt_br: Título
pt_pt: Título
ru: Заголовок
uk: Звертання
zh_hans: 标题

source: Ignored alerts
ar: التنبيهات التي تم تجاهلها
de: Ignorierte Warnungen
es: Alertas ignoradas
fr: Alertes ignorées
hu: Mellőzött figyelmeztetések
it: Avvisi ignorati
ja: 無視したアラート
ko: 무시한 경고
pt_br: Alertas ignorados
pt_pt: Alertas ignorados
ru: Проигнорированные оповещения
uk: Вимкнені оповіщення
zh_hans: 忽略提醒

source: Info
ar: معلومات
es: Información
fr: Information
hu: Infó
ja: 情報
ko: 정보
pt_br: Informações
ru: Информация
uk: Інформація
zh_hans: 信息

source: Input
ar: الإدخال
de: Eingabe
es: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt_br: Entrada
pt_pt: Entrada
ru: Ввод
uk: Вхідні дані
zh_hans: 输入

# instance_service_configuration_text
source: The instance service configuration or protocol is invalid. Include the details below in a bug report.
ar: إعداد خدمة النسخة أو بروتوكولها غير صالح. أدرج التفاصيل أدناه في تقرير خطأ.
fr: La configuration ou le protocole du service d'instance est invalide. Inclure les détails ci-dessous dans un rapport de bogue.
pt_br: A configuração ou o protocolo do serviço de instância é inválido. Inclua os detalhes abaixo em um relatório de bug.
pt_pt: A configuração ou o protocolo do serviço de instância é inválido. Inclua os detalhes abaixo num relatório de erro.

# instance_service_error_text
source: Keyguard could not start or contact its instance service. If this continues after restarting Keyguard, include the details below in a bug report.
ar: تعذّر على Keyguard بدء خدمة نسخته أو الاتصال بها. إذا استمر هذا بعد إعادة تشغيل Keyguard، فأدرج التفاصيل أدناه في تقرير خطأ.
fr: Keyguard n'a pas pu démarrer ou contacter son service d'instance. Si cela persiste après le relancement de Keyguard, incluez les détails ci-dessous dans un rapport de bogue.
pt_br: O Keyguard não conseguiu iniciar ou contatar seu serviço de instância. Se isso continuar após reiniciar o Keyguard, inclua os detalhes abaixo em um relatório de bug.
pt_pt: O Keyguard não conseguiu iniciar ou contactar o serviço de instância. Se o problema persistir após reiniciar o Keyguard, inclua os detalhes abaixo num relatório de erro.

# instance_service_error_title
source: Keyguard instance service failed
ar: فشلت خدمة نسخة Keyguard
fr: ​Échec du service d'instance de Keyguard
pt_br: Falha no serviço de instância do Keyguard
pt_pt: O serviço de instância do Keyguard falhou

# instance_service_permission_text
source: Keyguard cannot safely access its instance files. Check ownership and permissions of its data and runtime directories and their parent directories.
ar: لا يستطيع Keyguard الوصول إلى ملفات نسخته بأمان. تحقق من ملكية وأذونات مجلدات بياناته ووقت تشغيله والمجلدات الأصلية لها.
fr: Keyguard ne peut pas accéder en toute sécurité à ses fichiers d'instance. Vérifiez la propriété et les permissions de ses répertoires de données et d'exécution et de leurs répertoires parents.
pt_br: O Keyguard não consegue acessar com segurança seus arquivos de instância. Verifique a propriedade e as permissões dos diretórios de dados e de execução, e de seus diretórios pais.
pt_pt: O Keyguard não consegue aceder aos seus ficheiros de instância com segurança. Verifique a propriedade e as permissões dos diretórios de dados e de tempo de execução, bem como dos seus diretórios pai.

# instance_service_stopped_text
source: The instance service stopped and could not recover. Finish any edits, then quit and reopen Keyguard. Further launches cannot activate this window until you restart.
ar: توقفت خدمة النسخة وتعذّر استعادتها. أكمل أي تعديلات، ثم أغلق Keyguard وأعد فتحه. لا يمكن لعمليات التشغيل الإضافية تفعيل هذه النافذة حتى تعيد التشغيل.
fr: Le service d'instance s'est arrêté et n'a pas pu être récupéré. Terminez vos modifications, puis quittez et relancez Keyguard. Les lancements ultérieurs ne pourront pas activer cette fenêtre avant le redémarrage.
pt_br: O serviço de instância parou e não conseguiu se recuperar. Finalize quaisquer edições e, em seguida, feche e reabra o Keyguard. Novas execuções não conseguirão ativar esta janela até que você reinicie.
pt_pt: O serviço da instância foi interrompido e não pôde ser recuperado. Conclua quaisquer edições, feche e abra novamente o Keyguard. As futuras iniciações não ativarão esta janela até que reinicie o programa.

# instance_service_timeout_text
source: Another Keyguard process did not respond in time. Close that process and try again.
ar: لم تستجب عملية Keyguard أخرى في الوقت المناسب. أغلق تلك العملية وحاول مرة أخرى.
fr: Une autre instance de Keyguard n'a pas répondu à temps. Fermez cette instance et réessayez.
pt_br: Outro processo do Keyguard não respondeu a tempo. Feche esse processo e tente novamente.
pt_pt: Outro processo do Keyguard não respondeu a tempo. Feche esse processo e tente novamente.

# instance_service_unavailable_text
source: The native instance service is unavailable. Reinstall Keyguard if restarting it does not help.
ar: خدمة النسخة الأصلية غير متوفرة. أعد تثبيت Keyguard إذا لم تساعد إعادة تشغيله.
fr: Le service d'instance natif est indisponible. Réinstallez Keyguard si relancer ne suffit pas.
pt_br: O serviço de instância nativo está indisponível. Reinstale o Keyguard se reiniciá-lo não resolver.
pt_pt: O serviço de instância nativo está indisponível. Reinstale o Keyguard se reiniciá-lo não resolver o problema.

# ipc_approval_approve
source: Approve
ar: موافقة
de: Genehmigen
fr: Approuver
pt_br: Aprovar
pt_pt: Aprovar
uk: Схвалити
zh_hans: 批准

# ipc_approval_auth_reason
source: Approve an external cryptographic request
ar: الموافقة على طلب تشفيري خارجي
de: Externe kryptografische Anfrage genehmigen
fr: Approuver une demande cryptographique externe
pt_br: Aprovar uma solicitação criptográfica externa
pt_pt: Aprovar um pedido criptográfico externo
uk: Схвалити криптографічний запит від стороннього застосунку
zh_hans: 批准外部加密请求

# ipc_approval_deny
source: Deny
ar: رفض
de: Ablehnen
fr: Refuser
pt_br: Negar
pt_pt: Recusar
uk: Відхилити
zh_hans: 拒绝

# ipc_approval_message
source: %1$@ wants to %2$@.
ar: %1$@ يريد أن %2$@.
de: %1$@ möchte %2$@.
fr: %1$@ veut %2$@.
pt_br: %1$@ quer %2$@.
pt_pt: %1$@ quer %2$@.
uk: %1$@ хоче %2$@.
zh_hans: %1$@ 想要 %2$@。

# ipc_approval_no_keys
source: No eligible keys are available.
ar: لا تتوفر مفاتيح مؤهلة.
de: Keine geeigneten Schlüssel verfügbar.
fr: Aucune clé éligible n'est disponible.
pt_br: Nenhuma chave elegível está disponível.
pt_pt: Não existem chaves elegíveis disponíveis.
uk: Немає придатних ключів.
zh_hans: 没有找到可用的密钥。

# ipc_approval_no_keys_continue
source: No eligible keys are available. You can continue to check whether the signer is missing.
ar: لا تتوفر مفاتيح مؤهلة. يمكنك المتابعة للتحقق مما إذا كان الموقّع مفقودًا.
de: Keine geeigneten Schlüssel verfügbar. Sie können fortfahren, um zu prüfen, ob der Signaturschlüssel fehlt.
fr: Aucune clé éligible n'est disponible. Vous pouvez continuer à vérifier si le signataire est manquant.
pt_br: Nenhuma chave elegível está disponível. Você pode continuar para verificar se o assinante está ausente.
pt_pt: Não existem chaves válidas disponíveis. Pode continuar a verificar se o signatário está ausente.
uk: Немає придатних ключів. Можна продовжити, щоб перевірити, чи відсутній підписувач.
zh_hans: 没有符合条件的可用密钥。您可以继续检查签名者是否缺失。

# ipc_approval_operation
source: use %1$@ to %2$@
ar: استخدام %1$@ لـ %2$@
de: %1$@ verwenden, um %2$@
fr: utiliser %1$@ pour %2$@
pt_br: usar %1$@ para %2$@
pt_pt: Usar %1$@ para %2$@
uk: використати %1$@, щоб %2$@
zh_hans: 使用 %1$@ 来 %2$@

# ipc_approval_operation_with_registration
source: register with Keyguard and %1$@
ar: التسجيل في Keyguard و%1$@
de: sich bei Keyguard registrieren und %1$@
fr: se connecter avec Keyguard et %1$@
pt_br: registrar-se no Keyguard e %1$@
pt_pt: registar com Keyguard e %1$@
uk: зареєструватися в Keyguard і %1$@
zh_hans: 注册 Keyguard 并 %1$@

# ipc_approval_title
source: External app request
ar: طلب من تطبيق خارجي
de: Anfrage einer externen App
fr: Demande d'application externe
pt_br: Solicitação de aplicativo externo
pt_pt: Solicitação de aplicação externa
uk: Запит від стороннього застосунку
zh_hans: 外部应用请求

# ipc_approval_unavailable
source: This approval request expired or is no longer available.
ar: انتهت صلاحية طلب الموافقة هذا أو لم يعد متاحًا.
de: Diese Genehmigungsanfrage ist abgelaufen oder nicht mehr verfügbar.
fr: Cette demande d'approbation a expiré ou n'est plus disponible.
pt_br: Esta solicitação de aprovação expirou ou não está mais disponível.
pt_pt: Este pedido de aprovação expirou ou já não está disponível.
uk: Термін дії цього запиту на схвалення минув або він більше не доступний.
zh_hans: 此批准请求已过期或不再可用。

# ipc_operation_openpgp_autocrypt_status
source: check which recipients it can encrypt to
ar: التحقق من المستلمين الذين يمكن التشفير لهم
de: zu prüfen, für welche Empfänger verschlüsselt werden kann
fr: vérifier pour quels destinataires il peut chiffrer
pt_br: verificar para quais destinatários é possível criptografar
pt_pt: verificar para que destinatários pode ser encriptado
uk: перевірити, для яких отримувачів доступне шифрування
zh_hans: 检查可加密的接收者

# ipc_operation_openpgp_check_permission
source: confirm it has access
ar: تأكيد امتلاكه للوصول
de: seine Zugriffsberechtigung zu bestätigen
fr: confirmer qu'il a accès
pt_br: confirmar que ele tem acesso
pt_pt: confirmar que tem acesso
uk: підтвердити наявність доступу
zh_hans: 验证访问权限

# ipc_operation_openpgp_clear_sign
source: sign a message
ar: توقيع رسالة
de: eine Nachricht zu signieren
fr: signer un message
pt_br: assinar uma mensagem
pt_pt: assinar uma mensagem
uk: підписати повідомлення
zh_hans: 对消息进行签名

# ipc_operation_openpgp_decrypt_metadata
source: read a message's metadata
ar: قراءة بيانات وصفية لرسالة
de: die Metadaten einer Nachricht zu lesen
fr: lire les métadonnées d'un message
pt_br: ler os metadados de uma mensagem
pt_pt: ler os metadados de uma mensagem
uk: прочитати метадані повідомлення
zh_hans: 读取消息元数据

# ipc_operation_openpgp_decrypt_verify
source: decrypt or verify a message
ar: فك تشفير رسالة أو التحقق منها
de: eine Nachricht zu entschlüsseln oder zu überprüfen
fr: déchiffrer ou vérifier un message
pt_br: descriptografar ou verificar uma mensagem
pt_pt: desencriptar ou verificar uma mensagem
uk: розшифрувати або перевірити повідомлення
zh_hans: 解密或验证消息

# ipc_operation_openpgp_detached_sign
source: create a detached signature
ar: إنشاء توقيع منفصل
de: eine abgetrennte Signatur zu erstellen
fr: créer une signature détachée
pt_br: criar uma assinatura destacada
pt_pt: criar uma assinatura destacada
uk: створити відокремлений підпис
zh_hans: 创建独立签名

# ipc_operation_openpgp_encrypt
source: encrypt a message
ar: تشفير رسالة
de: eine Nachricht zu verschlüsseln
fr: chiffrer un message
pt_br: criptografar uma mensagem
pt_pt: encriptar uma mensagem
uk: зашифрувати повідомлення
zh_hans: 加密一条消息

# ipc_operation_openpgp_get_key
source: export a public key
ar: تصدير مفتاح عام
de: einen öffentlichen Schlüssel zu exportieren
fr: exporter une clé publique
pt_br: exportar uma chave pública
pt_pt: exportar uma chave pública
uk: експортувати відкритий ключ
zh_hans: 导出公钥

# ipc_operation_openpgp_get_key_ids
source: look up recipient keys
ar: البحث عن مفاتيح المستلمين
de: Empfängerschlüssel nachzuschlagen
fr: rechercher les clés du destinataire
pt_br: consultar chaves de destinatários
pt_pt: consultar chaves de destinatários
uk: знайти ключі отримувачів
zh_hans: 查找接收方密钥

# ipc_operation_openpgp_get_sign_key
source: choose a signing key
ar: اختيار مفتاح التوقيع
de: einen Signierschlüssel auszuwählen
fr: choisir une clé de signature
pt_br: escolher uma chave de assinatura
pt_pt: escolher uma chave de assinatura
uk: вибрати ключ для підпису
zh_hans: 选择签名密钥

# ipc_operation_openpgp_other
source: run an unrecognized operation
ar: تنفيذ عملية غير معروفة
de: einen unbekannten Vorgang auszuführen
fr: exécuter une opération non reconnue
pt_br: executar uma operação não reconhecida
pt_pt: executar uma operação não reconhecida
uk: виконати нерозпізнану операцію
zh_hans: 执行了无法识别的操作

# ipc_operation_openpgp_sign_and_encrypt
source: sign and encrypt a message
ar: توقيع رسالة وتشفيرها
de: eine Nachricht zu signieren und zu verschlüsseln
fr: signer et chiffrer un message
pt_br: assinar e criptografar uma mensagem
pt_pt: assinar e encriptar uma mensagem
uk: підписати й зашифрувати повідомлення
zh_hans: 签名并加密消息

# ipc_operation_ssh_get_public_key
source: read a public key
ar: قراءة مفتاح عام
de: einen öffentlichen Schlüssel zu lesen
fr: lire une clé publique
pt_br: ler uma chave pública
pt_pt: ler uma chave pública
uk: прочитати відкритий ключ
zh_hans: 读取公钥

# ipc_operation_ssh_get_ssh_public_key
source: read a public key in OpenSSH format
ar: قراءة مفتاح عام بصيغة OpenSSH
de: einen öffentlichen Schlüssel im OpenSSH-Format zu lesen
fr: lire une clé publique au format OpenSSH
pt_br: ler uma chave pública no formato OpenSSH
pt_pt: ler uma chave pública no formato OpenSSH
uk: прочитати відкритий ключ у форматі OpenSSH
zh_hans: 以OpenSSH格式读取公钥

# ipc_operation_ssh_other
source: run an unrecognized operation
ar: تنفيذ عملية غير معروفة
de: einen unbekannten Vorgang auszuführen
fr: exécuter une opération non reconnue
pt_br: executar uma operação não reconhecida
pt_pt: executar uma operação não reconhecida
uk: виконати нерозпізнану операцію
zh_hans: 执行了无法识别的操作

# ipc_operation_ssh_select_key
source: choose a key
ar: اختيار مفتاح
de: einen Schlüssel auszuwählen
fr: choisir une clé
pt_br: escolher uma chave
pt_pt: escolher uma chave
uk: вибрати ключ
zh_hans: 选择密钥

# ipc_operation_ssh_sign
source: sign an authentication challenge
ar: توقيع تحدٍّ للمصادقة
de: eine Authentifizierungsanforderung zu signieren
fr: signer un défi d'authentification
pt_br: assinar um desafio de autenticação
pt_pt: assinar um desafio de autenticação
uk: підписати запит автентифікації
zh_hans: 签署身份验证请求

# ipc_protocol_openpgp
source: GPG agent
ar: وكيل GPG
de: den GPG-Agenten
fr: Agent GPG
pt_br: Agente GPG
pt_pt: Agente GPG
uk: GPG-агент
zh_hans: GPG 代理

# ipc_protocol_ssh
source: SSH agent
ar: وكيل SSH
de: den SSH-Agenten
fr: Agent SSH
pt_br: Agente SSH
pt_pt: Agente SSH
uk: SSH-агент
zh_hans: SSH 代理

source: Item
ar: غرض
de: Element
es: Elemento
fr: Élément
hu: Elem
it: Elemento
ja: アイテム
ko: 항목
pt_pt: Entrada
ru: Элемент
uk: Запис
zh_hans: 条目
